def zadach1():
    countries_dict = {"Австрия": "Вена", "Бельгия": "Брюссель", "Великобритания": "Лондон", "Германия": "Берлин",
                      "Ирландия": "Дублин", "Лихтенштейн": "Вадуц", "Нидерладны": "Амстердам",
                      "Франция": "Париж", "Белоруссия": "Минск", "Болгария": "София", "Польша": "Варшава",
                      "Чехия": "Прага", "Албания": "Тирана", "Босния и Герцеговина": "Сараево",
                      "Северная Македония": "Скопье", "Сербия": "Белград"}
    print("Полный список стран: ")
    for i in countries_dict:
        print(i,'-',countries_dict[i])
    print('---------------------------')

    y = input("Введите список страны: ")
    print(countries_dict.get(y))
    print('---------------------------')

    print('Отсортированный список стран : ')
    for i in sorted(countries_dict):
        print(i, '-',countries_dict[i])

def zadach2():
    alph = {
        "а": 1,
        "б": 3,
        "в": 1,
        "г": 3,
        "д": 2,
        "е": 1,
        "ё": 3,
        "ж": 5,
        "з": 5,
        "и": 1,
        "й": 4,
        "к": 2,
        "л": 2,
        "м": 2,
        "н": 1,
        "о": 1,
        "п": 2,
        "р": 1,
        "с": 1,
        "т": 1,
        "у": 2,
        "ф": 10,
        "х": 5,
        "ц": 5,
        "ч": 5,
        "ш": 8,
        "щ": 10,
        "ъ": 10,
        "ы": 4,
        "ь": 3,
        "э": 8,
        "ю": 8,
        "я": 3
    }

    y = input('Введите слово: ')
    k=0
    for i in alph:
        for j in y:
            if i == j:
                k += alph[i]
    print('Сумма = ', k)

def zadach3():
    import random
    studen = ("Абийбиллаев", " Капров", "Иванов", " студент1", "студент2")
    lang = ("Англиский язык", "Китайский язык", "Французский язык", "Немецкий язык", "кыргызский язык")
    students = {}
    china = []
    for i in studen:
        single_lang = []
        for j in range(random.randint(1, 4)):
            single_lang.append(random.choice(lang))
        students[i] = sorted(list(set(single_lang)))
    print('список стутентов и языки: ')
    print(students)
    print('---------------------------------------------')

    for i in studen:
        print(i,"знает",len(students[i]))
        if 'Китайский язык' in students[i]:
            china.append(i)
    print('---------------------------------------------')
    if len(china) !=0:
        print(', '.join(china),"знает Китайский язык")
    else:
        print('таких нет')
zadach3()








